---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
source: html/43946308-b7ea-14c4-9263-77429e1589a1.htm
---
# KeyBasedTreeEntriesIterator Methods

Identifies if the iteration has completed.